NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/prov/src/prov_provisionee.c
/* Copyright (c) 2010 - 2018, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "prov_provisionee.h"

#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>

#include "nrf_error.h"

#include "enc.h"
#include "event.h"
#include "utils.h"
#include "log.h"

#include "provisioning.h"
#include "nrf_mesh_prov_bearer.h"
#include "prov_pdu.h"
#include "prov_utils.h"

#ifndef PROV_DEBUG_MODE
#define PROV_DEBUG_MODE 0
#endif

/****************** Call-back function declarations ******************/
static void prov_provisionee_pkt_in(prov_bearer_t * p_bearer, const uint8_t * p_buffer, uint16_t length);
static void prov_provisionee_cb_ack_received(prov_bearer_t * p_bearer);
static void prov_provisionee_cb_link_established(prov_bearer_t * p_bearer);
static void prov_provisionee_cb_link_closed(prov_bearer_t * p_bearer, nrf_mesh_prov_link_close_reason_t reason);
static const prov_bearer_callbacks_t m_prov_callbacks =
             {
                .rx = prov_provisionee_pkt_in,
                .ack = prov_provisionee_cb_ack_received,
                .opened = prov_provisionee_cb_link_established,
                .closed = prov_provisionee_cb_link_closed
             };

/****************** Local functions ******************/
static void send_failed(nrf_mesh_prov_ctx_t * p_ctx, nrf_mesh_prov_failure_code_t failure_code)
{
    nrf_mesh_prov_evt_t app_event;
    p_ctx->failure_code = failure_code;
    app_event.type = NRF_MESH_PROV_EVT_FAILED;
    app_event.params.failed.p_context =  p_ctx;
    app_event.params.failed.failure_code = failure_code;
    if (NRF_SUCCESS == prov_tx_failed(p_ctx->p_active_bearer, p_ctx->failure_code))
    {
        p_ctx->event_handler(&app_event);
        p_ctx->state = NRF_MESH_PROV_STATE_FAILED;
    }
    else
    {
        p_ctx->p_active_bearer->p_interface->link_close(
            p_ctx->p_active_bearer, NRF_MESH_PROV_LINK_CLOSE_REASON_ERROR);
        p_ctx->event_handler(&app_event);
        p_ctx->state = NRF_MESH_PROV_STATE_FAILED;
    }
}

static uint32_t send_capabilities(nrf_mesh_prov_ctx_t * p_ctx)
{
    prov_pdu_caps_t pdu;
    pdu.pdu_type = PROV_PDU_TYPE_CAPABILITIES;

    pdu.num_elements = p_ctx->capabilities.num_elements;
    pdu.algorithms = LE2BE16(p_ctx->capabilities.algorithms);
    pdu.pubkey_type = p_ctx->capabilities.pubkey_type;
    pdu.oob_static_types = p_ctx->capabilities.oob_static_types;
    pdu.oob_output_size = p_ctx->capabilities.oob_output_size;
    pdu.oob_output_actions = LE2BE16(p_ctx->capabilities.oob_output_actions);
    pdu.oob_input_size = p_ctx->capabilities.oob_input_size;
    pdu.oob_input_actions = LE2BE16(p_ctx->capabilities.oob_input_actions);

#if PROV_DEBUG_MODE
    __LOG(LOG_SRC_PROV, LOG_LEVEL_INFO, "Provisionee: sending capabilities\n");
#endif

    return prov_tx_capabilities(p_ctx->p_active_bearer, &pdu, p_ctx->confirmation_inputs);
}

static uint32_t handle_prov_start(nrf_mesh_prov_ctx_t * p_ctx, const uint8_t * p_buffer)
{
    const prov_pdu_prov_start_t * p_pdu = (const prov_pdu_prov_start_t *) p_buffer;

    if (p_pdu->algorithm >= NRF_MESH_PROV_ALGORITHM_RFU ||
        p_pdu->public_key >= NRF_MESH_PROV_PUBLIC_KEY_PROHIBITED ||
        p_pdu->auth_method >= NRF_MESH_PROV_OOB_METHOD_PROHIBITED)
    {
        return NRF_ERROR_INVALID_DATA;
    }

    if (p_pdu->public_key == NRF_MESH_PROV_PUBLIC_KEY_OOB &&
        p_ctx->capabilities.pubkey_type != NRF_MESH_PROV_OOB_PUBKEY_TYPE_OOB)
    {
        return NRF_ERROR_INVALID_DATA;
    }

    if ((p_pdu->auth_method == NRF_MESH_PROV_OOB_METHOD_NONE ||
         p_pdu->auth_method == NRF_MESH_PROV_OOB_METHOD_STATIC) &&
        (p_pdu->auth_action > 0 || p_pdu->auth_size > 0))
    {
        return NRF_ERROR_INVALID_DATA;
    }

    if (p_pdu->auth_method == NRF_MESH_PROV_OOB_METHOD_OUTPUT &&
       (p_pdu->auth_action >= NRF_MESH_PROV_OUTPUT_ACTION_RFU ||
        p_pdu->auth_size < 1 || p_pdu->auth_size > 8))
    {
        return NRF_ERROR_INVALID_LENGTH;
    }

    if (p_pdu->auth_method == NRF_MESH_PROV_OOB_METHOD_INPUT &&
       (p_pdu->auth_action >= NRF_MESH_PROV_INPUT_ACTION_RFU ||
        p_pdu->auth_size < 1 || p_pdu->auth_size > 8))
    {
        return NRF_ERROR_INVALID_LENGTH;
    }

    /* Copy PDU contents (excluding PDU type) into the confirmation inputs: */
    memcpy(p_ctx->confirmation_inputs + PROV_CONFIRM_INPUTS_START_OFFSET, p_buffer + 1, sizeof(prov_pdu_prov_start_t) - 1);

    p_ctx->pubkey_oob = (bool) p_pdu->public_key;
    p_ctx->oob_method = (nrf_mesh_prov_oob_method_t) p_pdu->auth_method;
    p_ctx->oob_size = p_pdu->auth_method != NRF_MESH_PROV_OOB_METHOD_STATIC ? p_pdu->auth_size : 16;
    p_ctx->oob_action = p_pdu->auth_action;

    return NRF_SUCCESS;
}

/* Handles an incoming provisioning data message. */
static uint32_t handle_data(nrf_mesh_prov_ctx_t * p_ctx, const uint8_t * p_buffer)
{
    const prov_pdu_data_t * p_pdu = (const prov_pdu_data_t *) p_buffer;

