NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/prov/src/prov_provisionee.c
                p_ctx->state = NRF_MESH_PROV_STATE_WAIT_PUB_KEY;
                if (p_ctx->pubkey_oob)
                {
                    memset(&event, 0, sizeof(nrf_mesh_prov_evt_t));

                    event.type = NRF_MESH_PROV_EVT_OOB_PUBKEY_REQUEST;
                    event.params.oob_pubkey_request.p_context = p_ctx;
                    p_ctx->event_handler(&event);
                }
            }
            break;
        case PROV_PDU_TYPE_PUBLIC_KEY:
            if (p_ctx->state == NRF_MESH_PROV_STATE_WAIT_PUB_KEY)
            {
#if PROV_DEBUG_MODE
                __LOG(LOG_SRC_PROV, LOG_LEVEL_INFO, "Provisionee: public key message received!\n");
#endif
                const prov_pdu_pubkey_t * p_pdu = (const prov_pdu_pubkey_t *) p_buffer;
                memcpy(p_ctx->peer_public_key, p_pdu->public_key, NRF_MESH_PROV_PUBKEY_SIZE);

                if (!p_ctx->pubkey_oob)
                {
                    if (NRF_SUCCESS != prov_tx_public_key(p_ctx->p_active_bearer, p_ctx->p_public_key))
                    {
                        send_failed(p_ctx, NRF_MESH_PROV_FAILURE_CODE_OUT_OF_RESOURCES);
                        break;
                    }
                }
                else
                {
                    start_authentication(p_ctx);
                }
            }
            break;
        case PROV_PDU_TYPE_CONFIRMATION:
            if (p_ctx->state == NRF_MESH_PROV_STATE_WAIT_CONFIRMATION)
            {
#if PROV_DEBUG_MODE
                __LOG(LOG_SRC_PROV, LOG_LEVEL_INFO, "Provisioning: provisioning confirmation received!\n");
#endif
                const prov_pdu_confirm_t * p_pdu = (const prov_pdu_confirm_t *) p_buffer;
                memcpy(p_ctx->peer_confirmation, p_pdu->confirmation, sizeof(p_ctx->peer_confirmation));

                uint8_t confirmation_value[PROV_CONFIRMATION_LEN];
                prov_utils_authentication_values_derive(p_ctx, p_ctx->confirmation_salt, confirmation_value, p_ctx->node_random);
                uint32_t err_code = prov_tx_confirmation(p_ctx->p_active_bearer, confirmation_value);
                if (NRF_SUCCESS != err_code)
                {
                    /* NRF_ERROR_NO_MEM is the only expected error code */
                    NRF_MESH_ASSERT(NRF_ERROR_NO_MEM == err_code);
                    send_failed(p_ctx, NRF_MESH_PROV_FAILURE_CODE_OUT_OF_RESOURCES);
                    break;
                }
            }
            else if (p_ctx->state == NRF_MESH_PROV_STATE_WAIT_OOB_STATIC)
            {
#if PROV_DEBUG_MODE
                __LOG(LOG_SRC_PROV, LOG_LEVEL_INFO, "Provisioning: provisioning confirmation received!\n");
#endif
                const prov_pdu_confirm_t * p_pdu = (const prov_pdu_confirm_t *) p_buffer;
                memcpy(p_ctx->peer_confirmation, p_pdu->confirmation, sizeof(p_ctx->peer_confirmation));
                p_ctx->state = NRF_MESH_PROV_STATE_WAIT_OOB_STATIC_C_RCVD;
            }

            break;
        case PROV_PDU_TYPE_RANDOM:
            if (p_ctx->state == NRF_MESH_PROV_STATE_WAIT_RANDOM)
            {
#if PROV_DEBUG_MODE
                __LOG(LOG_SRC_PROV, LOG_LEVEL_INFO, "Provisionee: provisioner's random number received!\n");
#endif
                const prov_pdu_random_t * p_pdu = (const prov_pdu_random_t *) p_buffer;
                memcpy(p_ctx->peer_random, p_pdu->random, sizeof(p_pdu->random));

                if (!prov_utils_confirmation_check(p_ctx))
                {
#if PROV_DEBUG_MODE
                    __LOG(LOG_SRC_PROV, LOG_LEVEL_WARN, "Provisionee: could not authenticate provisioner!\n");
#endif
                    send_failed(p_ctx, NRF_MESH_PROV_FAILURE_CODE_CONFIRMATION_FAILED);
                }
                else if (NRF_SUCCESS == prov_tx_random(p_ctx->p_active_bearer, p_ctx->node_random))
                {
                    prov_utils_derive_keys(p_ctx, p_ctx->session_key, p_ctx->data_nonce, p_ctx->device_key);
                }
                else
                {
                    send_failed(p_ctx, NRF_MESH_PROV_FAILURE_CODE_OUT_OF_RESOURCES);
                }
            }
            break;
        case PROV_PDU_TYPE_DATA:
            if (p_ctx->state == NRF_MESH_PROV_STATE_WAIT_DATA)
            {
#if PROV_DEBUG_MODE
                __LOG(LOG_SRC_PROV, LOG_LEVEL_INFO, "Provisionee: received provisioning data!\n");
#endif
                if (NRF_SUCCESS != handle_data(p_ctx, p_buffer))
                {
                    send_failed(p_ctx, NRF_MESH_PROV_FAILURE_CODE_DECRYPTION_FAILED);
                }
                else if (!prov_data_is_valid(&p_ctx->data))
                {
                    send_failed(p_ctx, NRF_MESH_PROV_FAILURE_CODE_INVALID_FORMAT);
                }
                else if (!prov_address_is_valid(&p_ctx->data, p_ctx->capabilities.num_elements))
                {
                    send_failed(p_ctx, NRF_MESH_PROV_FAILURE_CODE_CANNOT_ASSIGN_ADDR);
                }
                else if (NRF_SUCCESS != prov_tx_complete(p_ctx->p_active_bearer))
                {
                    send_failed(p_ctx, NRF_MESH_PROV_FAILURE_CODE_OUT_OF_RESOURCES);
                }
            }
            break;
        case PROV_PDU_TYPE_FAILED:
        {
            const prov_pdu_failed_t * p_pdu = (const prov_pdu_failed_t *) p_buffer;

            nrf_mesh_prov_evt_t app_event;
            app_event.type = NRF_MESH_PROV_EVT_FAILED;
            app_event.params.failed.p_context =  p_ctx;
            app_event.params.failed.failure_code = (nrf_mesh_prov_failure_code_t) p_pdu->failure_code;
            p_ctx->event_handler(&app_event);

            p_ctx->state = NRF_MESH_PROV_STATE_FAILED;

            break;
        }
        default:
            if (p_ctx->state != NRF_MESH_PROV_STATE_FAILED)
            {
#if PROV_DEBUG_MODE
                __LOG(LOG_SRC_PROV, LOG_LEVEL_WARN, "Provisioning: unknown provisioning message received, type = %.02x\n", p_buffer[0]);
#endif
                send_failed(p_ctx, NRF_MESH_PROV_FAILURE_CODE_INVALID_PDU);
            }
            break;
    }

