NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/prov/src/prov_provisionee.c
}

static void complete_provisioning(nrf_mesh_prov_ctx_t * p_ctx)
{
    nrf_mesh_prov_evt_t app_event;
    app_event.type = NRF_MESH_PROV_EVT_COMPLETE;
    app_event.params.complete.p_context = p_ctx;
    app_event.params.complete.p_devkey = p_ctx->device_key;
    app_event.params.complete.p_prov_data = &p_ctx->data;
    p_ctx->event_handler(&app_event);
}

static void prov_provisionee_cb_ack_received(prov_bearer_t * p_bearer)
{
    nrf_mesh_prov_ctx_t * p_ctx = prov_bearer_ctx_get(p_bearer);
    switch (p_ctx->state)
    {
        case NRF_MESH_PROV_STATE_INVITE:
            /* This is a response to send_capabilities */
            p_ctx->state = NRF_MESH_PROV_STATE_WAIT_START;
            break;
        case NRF_MESH_PROV_STATE_WAIT_START:
            break;
        case NRF_MESH_PROV_STATE_WAIT_PUB_KEY:
            start_authentication(p_ctx);
            break;
        case NRF_MESH_PROV_STATE_WAIT_OOB_INPUT:
            p_ctx->state = NRF_MESH_PROV_STATE_WAIT_CONFIRMATION;
            break;
        case NRF_MESH_PROV_STATE_WAIT_OOB_STATIC_C_RCVD:
        case NRF_MESH_PROV_STATE_WAIT_CONFIRMATION:
            p_ctx->state = NRF_MESH_PROV_STATE_WAIT_RANDOM;
            break;
        case NRF_MESH_PROV_STATE_WAIT_RANDOM:
            p_ctx->state = NRF_MESH_PROV_STATE_WAIT_DATA;
            break;
        case NRF_MESH_PROV_STATE_WAIT_DATA:
            complete_provisioning(p_ctx);
            p_ctx->state = NRF_MESH_PROV_STATE_COMPLETE;
            break;
        case NRF_MESH_PROV_STATE_FAILED:
            p_ctx->p_active_bearer->p_interface->link_close(
                p_ctx->p_active_bearer, NRF_MESH_PROV_LINK_CLOSE_REASON_ERROR);
            break;
        default:
            __LOG(LOG_SRC_PROV, LOG_LEVEL_ERROR, "Provisionee: unexpected ack while in state %u\n", p_ctx->state);
    }
}

static void prov_provisionee_cb_link_established(prov_bearer_t * p_bearer)
{
    nrf_mesh_prov_ctx_t * p_ctx = prov_bearer_ctx_get(p_bearer);
    p_ctx->p_active_bearer = p_bearer;
    /* Stop listening on all other bearers */
    prov_bearer_t * p_tmp_bearer;
    LIST_FOREACH(p_item, p_ctx->p_bearers)
    {
        p_tmp_bearer = PARENT_BY_FIELD_GET(prov_bearer_t, node, p_item);
        if (p_tmp_bearer != p_bearer)
        {
            (void) p_tmp_bearer->p_interface->listen_stop(p_tmp_bearer);
        }
    }

    p_ctx->state = NRF_MESH_PROV_STATE_INVITE;
    nrf_mesh_prov_evt_t app_event;
    app_event.type = NRF_MESH_PROV_EVT_LINK_ESTABLISHED;
    app_event.params.link_established.p_context =  p_ctx;
    p_ctx->event_handler(&app_event);
}
static void prov_provisionee_cb_link_closed(prov_bearer_t * p_bearer, nrf_mesh_prov_link_close_reason_t reason)
{
    nrf_mesh_prov_ctx_t * p_ctx = prov_bearer_ctx_get(p_bearer);
    if (p_ctx->state == NRF_MESH_PROV_STATE_WAIT_DATA && reason == NRF_MESH_PROV_LINK_CLOSE_REASON_SUCCESS)
    {
        complete_provisioning(p_ctx);
    }
    p_ctx->state = NRF_MESH_PROV_STATE_IDLE;
    nrf_mesh_prov_evt_t app_event;
    app_event.type = NRF_MESH_PROV_EVT_LINK_CLOSED;
    app_event.params.link_closed.p_context =  p_ctx;
    app_event.params.link_closed.close_reason = reason;
    p_ctx->event_handler(&app_event);
}

/****************** Interface functions ******************/

uint32_t prov_provisionee_listen(nrf_mesh_prov_ctx_t * p_ctx, prov_bearer_t * p_bearer, const char * URI, uint16_t oob_info_sources)
{
    if (p_ctx->state != NRF_MESH_PROV_STATE_IDLE &&
        p_ctx->state != NRF_MESH_PROV_STATE_WAIT_LINK)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    else
    {
        p_bearer->p_callbacks = &m_prov_callbacks;
        return p_bearer->p_interface->listen_start(
            p_bearer, URI, oob_info_sources, NRF_MESH_PROV_LINK_TIMEOUT_MIN_US);
    }
}

uint32_t prov_provisionee_auth_data(nrf_mesh_prov_ctx_t * p_ctx, const uint8_t * p_data, uint8_t size)
{
    //TODO: This interaction could be done in init. We don't provide any new information in the event triggering this.
    if (p_ctx->state != NRF_MESH_PROV_STATE_WAIT_OOB_INPUT
            && p_ctx->state != NRF_MESH_PROV_STATE_WAIT_OOB_STATIC
            && p_ctx->state != NRF_MESH_PROV_STATE_WAIT_OOB_STATIC_C_RCVD)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    uint32_t retval = NRF_SUCCESS;
    if (p_ctx->state == NRF_MESH_PROV_STATE_WAIT_OOB_INPUT)
    {
        retval = prov_tx_input_complete(p_ctx->p_active_bearer);
        if (NRF_SUCCESS != retval)
        {
            return retval;
        }
    }
    else if (p_ctx->state == NRF_MESH_PROV_STATE_WAIT_OOB_STATIC_C_RCVD)
    {
        uint8_t confirmation_value[PROV_CONFIRMATION_LEN];
        prov_utils_authentication_values_derive(p_ctx, p_ctx->confirmation_salt, confirmation_value, p_ctx->node_random);
        retval = prov_tx_confirmation(p_ctx->p_active_bearer, confirmation_value);
    }
    else
    {
        p_ctx->state = NRF_MESH_PROV_STATE_WAIT_CONFIRMATION;
    }

    return retval;
}

uint32_t prov_provisionee_shared_secret(nrf_mesh_prov_ctx_t * p_ctx, const uint8_t * p_shared)
{
    if (p_ctx->state != NRF_MESH_PROV_STATE_WAIT_EXTERNAL_ECDH)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    if (p_shared == NULL)
    {
        return NRF_ERROR_NULL;
    }

    memcpy(p_ctx->shared_secret, p_shared, sizeof(p_ctx->shared_secret));
    return request_authentication(p_ctx);
}
